#define _CRT_SECURE_NO_WARNINGS
#include<stdio.h>
//声明外部函数
extern int Add(int x, int y);

int main()
{
	int a = 10;
	int b = 20;
	int sum = Add(a, b);
	printf("sum = %d\n", sum);

	return 0;
}
//}
//extern int g_val;
//
//int main()
//{
//	printf("%d\n", g_val);
//
//	return 0;
//}
//
//void test()
//{
//    static int a = 1;
//	a++;
//	printf("%d ", a);
//}
//
//int main()
//{
//	int i = 0;
//
//	//循环执行10次
//	while (i<10)
//	{
//		test();
//		i++;
//	}
//
//	return 0;
//}


//int main()
//{
//	//逗号表达式从左向右依次计算，但是整个表达式的结果是最后一个表达式的结果
//
//	int a = (3+1,5+2,8+1,2-4);
//
//	printf("%d\n", a);//-2
//
//	return 0;
//}

//int main()
//{
//	int a = 10;
//	int b = 20;
//	int max = 0;
//
//	/*if (a > b)
//	{
//		max = a;
//	}
//	else
//	{
//		max = b;
//	}*/
//
//	max = (a > b ? a : b);
//	printf("max = %d\n", max);
//
//	return 0;
//}

//int main()
//{
//	int a = 10;
//	int b = 0;
//	int c = a && b;//逻辑与
//	int d = a || b;//逻辑或
//
//	printf("c = %d  d=%d\n", c,d);
//
//	return 0;
//}
//int main()
//{
//	int a = 10;
//	int b = ++a;//前置++，先给a的值+1，再使用
//	printf("a = %d b = %d\n", a, b);//a=11 b=11
//	int e = 10;
//	int c = e++;//后置++，先使用a的值，再让a加1
//	printf("e = %d c = %d\n", e, c);//e=11 c=10
//
//	return 0;
//}

//int main()
//{
//	int a = 0;
//	//
//	//00000000000000000000000000000000
//	//01111111111111111111111111111111 - 补码
//	//11111111111111111111111111111110 - 反码
//	//10000000000000000000000000000001 - 原码
//	printf("%d\n", ~a);//-1
//	return 0;
//}
////C语言如何区分真和假的呢？
////0 - 表示假
////非0 - 表示真
////
//
//int main()
//{
//
//	int a = 10;//
//	int b = 0;
//	printf("%d\n", a);//10
//	printf("%d\n", !a);//0
//	printf("%d\n", b);//0
//	printf("%d\n", !b);//1
//
//	return 0;
//}
//int main()
//{
//	//&
//	int a = 3;
//	int b = 5;
//
//	int c = a^b;//按（二进制）位异或
//	//00000000000000000000000000000011
//	//00000000000000000000000000000101
//	//00000000000000000000000000000110
//	//6
//
//	int e = a | b;//按（二进制）位或
//	//00000000000000000000000000000011
//	//00000000000000000000000000000101
//	//00000000000000000000000000000111
//	//7
//
//	int f = a&b;//按（二进制）位与
//	//00000000000000000000000000000011
//	//00000000000000000000000000000101
//	//00000000000000000000000000000001 - 1
//	//
//	printf("%d  %d   %d\n", c,e,f);
//	return 0;
//}
//int main()
//{
//	//整形是4个字节的 - 32bit位
//	int a = 8;
//	//本质上移动的是a的二进制位
//	int b = a >> 1;//把a的值向右移动一位
//	printf("%d\n", b);
//
//	//8 - 10进制
//	//00000000000000000000000000001000
//
//
//
//	return 0;
//}
//int main()
//{
//	printf("%d\n", 7 / 2);//商
//	printf("%d\n", 7 % 2);//% - 取模 - 取模得到的是余数
//
//	return 0;
//}

//int main()
//{
//	printf("%f\n", 7 / 2.0);
//
//	return 0;
//}
//int main()
//{
//	//初始化数组arr的前5个元素为1,2,3,4,5，剩下的5个元素默认会被初始化为0
//	int arr[10] = {1,2,3,4,5,6,7,8,9,10};
//	//一次一个一个的打印的
//	int i = 0;
//	while (i < 10)
//	{
//		printf("%d ", arr[i]);
//		i++;
//	}
//	/*printf("%d\n", arr[5]);
//	printf("%d\n", arr[9]);
//*/
//
//	return 0;
//}